Revit 2020 API
FabricationDimensionUnitType Enumeration
 Fabrication dimension unit type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2016
Since: 2016
Syntax
C#
public enum FabricationDimensionUnitType
Visual Basic
Public Enumeration FabricationDimensionUnitType
Visual C++
public enum class FabricationDimensionUnitType
Members
Member name | Description
NoUnits |  NoUnits.
Linear |  Linear.
Angular |  Angular.
See Also
Autodesk.Revit.DB Namespace